---
kind: type
id: T:Autodesk.Revit.DB.ExternalResourceType
source: html/3fbd8c3c-1fa9-1f70-044e-b9e92f025a5e.htm
---
# Autodesk.Revit.DB.ExternalResourceType

A type class used to distinguish between different kinds of external resource.

## Syntax (C#)
```csharp
public class ExternalResourceType : GuidEnum
```

## Remarks
Revit elements can consume multiple types of external resource data, provided by one or more
 external servers. Conversely, external servers can support one, or more than one, type of
 external resource.